[
    {"quote": "Низкоуровневый язык — это когда требуется внимание к вещам, которые никак не связаны с программами на этом языке. Rick Cook"},
    {"quote": "Программирование на С похоже на быстрые танцы на только что отполированном полу людей с острыми бритвами в руках. Waldi Ravens"},
    {"quote": "Не волнуйтесь, если что-то не работает. Если бы всё работало, вас бы уволили. Mosher's Law of Software Engineering"},
    {"quote": "Для меня долгое время было загадкой, как что-то очень дорогое и технологичное может быть столь бесполезным. И вскоре я осознал, что компьютер — это глупая машина, обладающая способностями выполнять невероятно умные вещи, тогда как программисты — это умные люди, у которых талант делать невероятные глупости. Короче, они нашли друг друга. Bill Bryson"},
    {"quote": "В хорошем дизайне добавление чего-то стоит дешевле, чем сама эта вещь. Thomas C. Gale"},
    {"quote": "В теории, теория и практика неразделимы. На практике это не так. Yoggi Berra"},
    {"quote": "Perl — это тот язык, который одинаково выглядит как до, так и после RSA шифрования. Keith Bostic" },
    {"quote": "Я изобрел понятие «объектно-ориентированный», и могу заявить, что не имел в виду C++. Alan Kay" },
    {"quote": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода. Christopher Thompson" },
    {"quote": "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку самолета по его весу. Bill Gates"},
    {"quote": "Отладка кода вдвое сложнее, чем его написание. Так что если вы пишете код настолько умно, насколько можете, то вы по определению недостаточно сообразительны, чтобы его отлаживать. Brian W. Kernighan"},
    {"quote": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня. Larry Wall"},
    {"quote": "Большинство программ на сегодняшний день подобны египетским пирамидам из миллиона кирпичиков друг на друге и без конструктивной целостности — они просто построены грубой силой и тысячами рабов. Alan Kay" },
    {"quote": "Большинство хороших программистов делают свою работу не потому, что ожидают оплаты или признания, а потому что получают удовольствие от программирования. Linus Torvalds"}
]